In [2]:
import pandas as pd 
import numpy as np

In [3]:
d = {'A': [1,2,np.nan], 'B': [5, np.nan, np.nan], 'C': [8,9,10]}

In [4]:
df = pd.DataFrame(data=d)

In [5]:
df

     A    B   C
0  1.0  5.0   8
1  2.0  NaN   9
2  NaN  NaN  10

In [11]:
# drop row with missing or null value 
df.dropna(axis=0)  # axis = 1 drops all columns with null values in the df

     A    B  C
0  1.0  5.0  8

In [21]:
df.dropna(axis=0, thresh=2)  # this will keeps rows that have alteast 2 non na values

     A    B  C
0  1.0  5.0  8
1  2.0  NaN  9

In [19]:
df.dropna(axis=1, thresh=2) # this will keep all columns that have atleast 2 non na values in them

     A   C
0  1.0   8
1  2.0   9
2  NaN  10

In [23]:
# fillna 
df.fillna(value=0) # fill in the nan values with zeros.

     A    B   C
0  1.0  5.0   8
1  2.0  0.0   9
2  0.0  0.0  10

In [41]:
cols = df.columns

for c in cols: 
    df[c].fillna(value=df[c].mean(), inplace=True)  # fill in the na values with the mean of each column. 
    
df

     A    B   C
0  1.0  5.0   8
1  2.0  5.0   9
2  1.5  5.0  10

### group by with Pandas

In [42]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [43]:
df = pd.DataFrame(data)

In [44]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [45]:
gb = df.groupby('Company')

In [51]:
gb.mean()

/var/folders/d3/_7288rcs4xndpk19gjv1ms640000gn/T/ipykernel_22493/553916201.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  gb.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [52]:
gb.std()

/var/folders/d3/_7288rcs4xndpk19gjv1ms640000gn/T/ipykernel_22493/1693660272.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.std is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  gb.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [54]:
gb.sum().loc['FB']

/var/folders/d3/_7288rcs4xndpk19gjv1ms640000gn/T/ipykernel_22493/3160839170.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  gb.sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [55]:
gb.count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [56]:
gb.min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [57]:
gb.max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [58]:
gb.describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [59]:
gb.describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000